# Наследование классов
# Создайте класс для автомобилей, указав у этого класса необходимые свойства (подумайте, какие именно свойства можно указать для 
    # всех автомобилей, но обязательно должны быть координаты x и y, в которых находится автомобиль).
# Создайте метод движения, где через print выведите: «Движение автомобиля в точку x, y», где x и y – это координаты, 
    # переданные в методе. Не забудьте обновить x и y в этом методе на новые.
# Создайте дочерний класс для какой-нибудь конкретной модели автомобиля. Придумайте какое-нибудь свойство, которое характерно 
    # именно для этой модели, и добавьте его.
# Переопределите метод движения. В новом методе должны так же меняться координаты, но при этом в print должно выводиться 
    #  не «автомобиль», а название конкретного автомобиля, для которого был создан этот класс.
# Создайте экземпляры обоих классов и проверьте работу их свойств и методов.

class Auto:
    x = 0
    y = 0
    s = 0
    def __init__(self, x, y, s):
        self.x = x
        self.y = y
        self.s = s
    def mov(self):
        print('Движение автомобиля в точку X: ' + str(self.x) + ' Y: ' + str(self.y) + ' со скоростью: ' + str(self.s))

class ferrari(Auto):
    m = 0
    def __init__(self, x, y, s, m):
        Auto.__init__(self, x, y, s)
        self.m = m
    def mov(self):
        print('Движение Ferrari в точку X: ' + str(self.x) + ' Y: ' + str(self.y)+ ' со скоростью: ' + str(self.s) + ' с ' + str(self.m) +' пассажирами')

a = Auto(10, 20, 60)
a.mov()
f = ferrari(10, 20, 120, 2)
f.mov()


    

