# Конструктор класса
# Возьмите за основу класс прямоугольника из предыдущего упражнения.
# Создайте у него конструктор, принимающий в качестве параметров все его свойства.
# Внутри конструктора инициализируйте свойства переданными в него параметрами.
# Используя конструктор, создайте экземпляр класса (объект).
# Выведите его свойства.

class Rectangle:
    x = 0
    y = 0
    w = 0
    h = 0
    def __init__(self, x, y, w, h):
        self.x = x
        self.y = y
        self.w = w
        self.h = h
        

r1 = Rectangle(5, 3, 12, 6)
print(r1.x, ",", r1.y, ";", r1.w, ";", r1.h)