# Функции для работы со словарями
#  Создайте словарь из 3-х ключей «Hello», «Bуe» и «Lesson» и значениями соответственно «Здравствуй», «Пока» и «Урок».
# В бесконечном цикле выводите случайное значение из словаря и просите пользователя написать перевод на английском.
# Проверяйте на соответствие введённой пользователем строки и ключа словаря. Если пользователь ввёл всё правильно, 
    # то выводить ему следующее слово. Если неправильно, то сообщать ему об этом, и заново ждать от него ответа.
    #  И так до тех пор, пока он не введёт правильный ответ.
# Если пользователь вводит команду «show», то вывести словарь.
# Если пользователь вводит «quit», то завершать программу.
# Примечание: не забывайте, что если пользователь будет писать, например: «hello», «Hello» или «HELlo» - 
    # то это всё считать правильными ответами.
import random

dict = {'здравствуй': 'hello', 'пока': 'bye', 'Урок': 'lesson'}

# Наверное можно сделать красивей, но вышло так

while True:
    q = (random.choice(list(dict.keys())))
    print(q)
    ans = input("Введите перевод (для выхода - quit; для просмотра словаря - show):")
    ans = ans.lower()
    if ans == 'quit':
        exit(0)
    elif ans == 'show':
        print(dict)
        continue
    while ans != dict[q]:
        if ans == 'quit':
            exit(0)
        elif ans == 'show':
            print(dict)
            break
        print('Wrong! Lets try again')
        print(q)
        ans = input("Введите перевод (для выхода - quit; для просмотра словаря - show):")
        ans = ans.lower()    






