# Функции для работы со множествами
# Создайте 2 множества, состоящие из 10 случайных целых чисел от 1 до 10 (включая 1 и 10).
# Выведите 3 множества: объединением этих двух множеств, их разницей и их пересечением.

set1 = {1, 3, 5, 1, 4, 3, 1, 3, 7, 7}
set2 = {3, 2, 3, 4, 6, 6, 8, 9, 10, 2}
print(set1)
print(set2)

print(set1.union(set2))
print(set1.intersection(set2))
print(set2.difference(set1))