# Математические функции
# Выведите число, округлив его до 2 знаков после запятой.
# Выведите с шагом в 1 градус все значения синуса угла от 0 до 180 градусов в таком виде: «sin(УГОЛ_В_ГРАДУСАХ) = РЕЗУЛЬТАТ».
# Примечание: разумеется, стоит использовать цикл.
import math
print(round(5.883283742, 2))

i = 0
while i <=180:
    print("sin", i, "градусов =", math.sin(math.radians(i)))
    i +=1

