# Строковые функции
# Попросите пользователя ввести произвольную строку.
# Выведите коды всех символов строки, введённой пользователем.
# Попросите пользователя ввести строку, состоящую только из цифр.
# Используя соответствующую функцию, проверьте введённую пользователем строку, и если он ввёл правильно, то написать «Спасибо!», 
# иначе выбросить исключение, в обработке которого вывести строку «Некорректный ввод!».

str1 = input("ввести произвольную строку: ")
for i in str1:
    print(ord(i))

# Функция проверки строки на числа
def check(str2):
    try:
        int(str2)
    except ValueError:
        print("Некорректный ввод!")
    else:
        print("Спасибо!")
# То же самое, но с возвращаемым значением
def check2(str2):
    try:
        int(str2)
        return "Спасибо!"
    except ValueError:
        return "Некорректный ввод!" 
    
str2 = input("ввести строку, состоящую только из цифр: ")
check(str2)
print("______________")
print(check2(str2))


