# Функции для работы со списками и кортежами
# Попросите пользователя указать, какое количество элементов надо создать в списке.
# Сделайте цикл на соответствующее число итераций, в каждой из которых просите пользователя ввести число в таком формате: 
    # «Введите число N:», где N – текущий номер числа.
# Добавляйте каждое это число в список.
# По завершению цикла выведите получившийся список.

arrl = input("какое количество элементов надо создать в списке: ")
arr = []
i = 1
while i <= int(arrl):
    a = input(f"Введите число {i}: ")
    arr.append(a)
    i += 1
print(arr)