# Функции для работы с файлами
# Попросите пользователя ввести команду «read» или «copy».
# Попросите у пользователь ввести путь к файлу, содержимое которого он хочет посмотреть, либо скопировать.
    #  Причём, если пользователь ввёл до этого «read», то надо написать: «Напишите путь к файлу, содержимое 
    # которого Вы хотите посмотреть:». А если была команда «copy», то: «Напишите путь к файлу, который Вы хотите скопировать:»
# Если была команда «read», то вывести пользователю содержимое файла.
# Если была команда «copy», то сделайте копию файла. Копия файла должна называться так же, как и исходный файл, 
    # и находиться она должна в директории files, находящейся в той же директории, что и файл скрипта.
# Примечание: будьте аккуратны и не очистите какие-нибудь важные файлы в процессе экспериментов. Создайте лучше 
    # какой-нибудь новый файл для этой задачи.
import shutil

while True:
    print('ввести команду «read» или «copy» or exit')
    inp = input("Введите команду: ")
    if inp == 'exit':
        exit(0)
    if inp == 'read':
        read = input('Напишите путь к файлу, содержимое которого Вы хотите посмотреть: ')
        try:
            handler = open(read, 'r')
            print(handler.read())
            handler.close()
        except FileNotFoundError:
            print("Файла ещё не существует!")
    elif inp == 'copy':
        copy = input("Напишите путь к файлу, который Вы хотите скопировать: ")
        try:
            shutil.copyfile(copy, 'D:\Учеба\Python\source_code\Practice_tasks\MainFunctions\copy.txt')
        except FileNotFoundError:
            print("Файла ещё не существует!")
    else:
        print("Неизвестная команда")




