# цикл for генераторы списков
# Создайте список из 5 чисел.
# Определите сумму чисел в списке и выведите её.
# Определите среднее арифметическое чисел в списке и выведите его.
# Примечание: при выполнении заданий используйте цикл for.

array = [i for i in range(1, 6)]
#array = [1, 4, 7, 9, 12]
print(array)
i = 0
for n in array:
    i = i + n
print(i)
print(i / len(array))

