# Кортежи
# Попросите пользователя ввести произвольную строку.
# Создайте кортеж, состоящий из символов, введённой пользователем строки.
# Выведите кортеж, используя цикл for.

n = input("введите строку для кортежа: ")
mytuple = tuple(n)
for s in mytuple:
    print(s)
