# Масствы
# Создайте список, состоящий из строк.
# Выведите все элементы списка в таком виде: «ИНДЕКС_ЭЛЕМЕНТА – ЭЛЕМЕНТ;»
# Попросите пользователя ввести индекс того элемента, значение которого он хочет посмотреть.
# Выведите значение элемента по индексу, полученному от пользователя.
# Примечание: если пользователь ввёл индекс, которого нет, то написать ему об этом так: «Элемента с таким индексом не существует».

list = ['ЭЛЕМЕНТ ОДИН', 'ЭЛЕМЕНТ ДВА', 'ЭЛЕМЕНТ ТРИ']
i = 0
while i < len(list):
    print(i, "-", list[i])
    i += 1

print("__________________")
print("To exit enter \"exit\"")
while True:
    index = input("To see the elment of array enter his index: ")
    if index == "exit":
        break
    if int(index) < len(list):
        print("данному индексу соответсвует следующий элемет массива:", list[int(index)])
    if int(index) == len(list) or int(index) > len(list):
        print("Элемента c таким индексом не существует, введите другой")       


