# Модули
# Создайте свой модуль и подключите его в основном файле.
# Напишите в модули 3 функции, каждая из которых принимает список. Первая функция – получение максимального значения, вторая – получение минимального значения, третья – получение суммы всех элементов.
# Проверьте работу этих функций в основном файле.

import base16calc as ca

print("Максимальное значение списка [1, 3, 4, 5, 6, 7] = ", ca.getmax([1, 3, 4, 5, 6, 7]))
print("Минимальное значение списка [-1, 3, 4, -6, 5] = ", ca.getmin([-1, 3, 4, -6, 5]))
print("Сумма всех элементов списка [1, 2, 3, 4, 5] = ", ca.getsum([1, 2, 3, 4, 5]))



