# Отладка
# Создайте список из 5 чисел.
# Напишите функцию, которая находит все отрицательные числа и выводит их.
#) С помощью отладки пройдите все шаги выполнения программы, анализируя значения всех переменных.

arr = [1, -4, 3, -7 , 5, 6]

def Neg(arr):
    s = [i for i in arr if i < 0]
    return s
    
def Negative(arr):
    for i in arr:
        if i < 0:
            print(i)

print(Neg(arr))
Negative(arr)