# Множества
# Попросите пользователя ввести количество элементов для списка.
# Создайте список, состоящий из целых случайных чисел от 0 до 100, заданного пользователем количества.
# Выведите этот список с помощью цикла while.
# С помощью множеств удалите из списка все повторяющиеся значения.
# Выведите получившийся список с помощью цикла for.
import random

n = input("Введите количество элементов для списка: ")
arr = [int(random.random()*100) for i in range(0, int(n))]
i = 0
while i < len(arr):
    print(arr[i])
    i+=1
print(arr)

print("______________")
arr = list(set(arr))
for s in arr:
    print(s)
print(arr)
