# Глобальные переменные
# Создайте переменную со значением числа пи: «3.141592».
# Напишите функцию, которая будет возвращать площадь окружности по переданному в параметре радиусу.
# Проверьте работу функции.
# Примечание: площадь окружности = пи * радиус * радиус. Значение числа пи надо взять из глобальной переменной, созданной в первом пункте.

pi = 3.141592

def radius(r):
    rad = float(pi)*(float(r)*float(r))
    return rad

r = input("Введите радиус: ")
print("площадь окружности =", radius(r))


